Conf.Simple/src/Catalogs/SUI_ШаблоныЭтикетокZPL/SUI_ШаблоныЭтикетокZPL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_ШаблоныЭтикетокZPL</name>
  <attributes>
    <name>ВыполнятьЗапросВПакетномРежиме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодZPL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитDataMatrix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПакетыРезультатаЗапроса</name>
    <attributes>
      <name>ИндексРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_ШаблоныЭтикетокZPL/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить данные конструктора запроса из шаблона этикетки.
// 
// Параметры:
//  ШаблонСсылка - СправочникСсылка.SUI_ШаблоныЭтикетокZPL - Ссылка шаблона этикетки
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить данные конструктора запроса см. SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора
Функция ПолучитьДанныеКонструктораЗапроса(ШаблонСсылка) Экспорт
	
	Перем ДанныеКонструктора;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныЭтикетокZPL.ВыполнятьЗапросВПакетномРежиме,
		|	ШаблоныЭтикетокZPL.ТекстЗапроса,
		|	ШаблоныЭтикетокZPL.ПакетыРезультатаЗапроса.(
		|		ИндексРезультата) КАК ПакетыРезультатаЗапроса
		|ИЗ
		|	Справочник.SUI_ШаблоныЭтикетокZPL КАК ШаблоныЭтикетокZPL
		|ГДЕ
		|	ШаблоныЭтикетокZPL.Ссылка = &ШаблонСсылка";
	
	Запрос.УстановитьПараметр("ШаблонСсылка", ШаблонСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Не ПустаяСтрока(Выборка.ТекстЗапроса) Тогда
			
			ДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();
			ДанныеКонструктора.ТекстЗапроса = Выборка.ТекстЗапроса;
			ДанныеКонструктора.ВыполнятьВПакетномРежиме = Выборка.ВыполнятьЗапросВПакетномРежиме;
			ДанныеКонструктора.ПакетыРезультата = Выборка.ПакетыРезультатаЗапроса.Выгрузить().ВыгрузитьКолонку("ИндексРезультата");
			
		КонецЕсли;
		
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ДанныеКонструктора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
